Tekla Open API Reference for Tekla Structures 2025
AnalysisCurvature Class
 The AnalysisCurvature class contains information related to analysis curvatures.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisCurvature
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisCurvature
Public NotInheritable Class AnalysisCurvature
The AnalysisCurvature type exposes the following members.
Constructors
Name | Description
AnalysisCurvature
Initializes a new instance of the AnalysisCurvature class
Top
Properties
Name | Description
Radius
 The radius of the beam curvature.
RadiusDirection
 The radius direction of the beam curvature.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace